In [5]:
import pandas as pd
data = pd.read_csv(r"C:\Users\keert\Downloads\customer_order.csv")

In [6]:
data

    Order_ID Customer_Name Product  Quantity    Price
0        101          Amit  Laptop       1.0  50000.0
1        102          Riya  Mobile       2.0  15000.0
2        103          John  Tablet       NaN  20000.0
3        104          Sara  Laptop       1.0  52000.0
4        105          Amit  Mobile       3.0      NaN
5        106         Kiran  Tablet       2.0  21000.0
6        103          John  Tablet       NaN  20000.0
7        107          Neha  Laptop       1.0  48000.0
8        108         Pooja  Mobile       2.0  16000.0
9        109          Ravi  Laptop       1.0      NaN
10       103          John  Tablet       NaN  20000.0

In [8]:
data.shape

(11, 5)

In [9]:
data.isna().sum()

Order_ID         0
Customer_Name    0
Product          0
Quantity         3
Price            2
dtype: int64

In [14]:
for col in data.select_dtypes(include=["int64","float64"]).columns:
    data[col] = data[col].fillna(data[col].median())

In [15]:
data

    Order_ID Customer_Name Product  Quantity    Price
0        101          Amit  Laptop       1.0  50000.0
1        102          Riya  Mobile       2.0  15000.0
2        103          John  Tablet       1.5  20000.0
3        104          Sara  Laptop       1.0  52000.0
4        105          Amit  Mobile       3.0  20000.0
5        106         Kiran  Tablet       2.0  21000.0
6        103          John  Tablet       1.5  20000.0
7        107          Neha  Laptop       1.0  48000.0
8        108         Pooja  Mobile       2.0  16000.0
9        109          Ravi  Laptop       1.0  20000.0
10       103          John  Tablet       1.5  20000.0

In [17]:
data = data.drop_duplicates()

In [18]:
data

   Order_ID Customer_Name Product  Quantity    Price
0       101          Amit  Laptop       1.0  50000.0
1       102          Riya  Mobile       2.0  15000.0
2       103          John  Tablet       1.5  20000.0
3       104          Sara  Laptop       1.0  52000.0
4       105          Amit  Mobile       3.0  20000.0
5       106         Kiran  Tablet       2.0  21000.0
7       107          Neha  Laptop       1.0  48000.0
8       108         Pooja  Mobile       2.0  16000.0
9       109          Ravi  Laptop       1.0  20000.0

In [20]:
data.shape

(9, 5)

In [21]:
data.head()

   Order_ID Customer_Name Product  Quantity    Price
0       101          Amit  Laptop       1.0  50000.0
1       102          Riya  Mobile       2.0  15000.0
2       103          John  Tablet       1.5  20000.0
3       104          Sara  Laptop       1.0  52000.0
4       105          Amit  Mobile       3.0  20000.0

In [22]:
data

   Order_ID Customer_Name Product  Quantity    Price
0       101          Amit  Laptop       1.0  50000.0
1       102          Riya  Mobile       2.0  15000.0
2       103          John  Tablet       1.5  20000.0
3       104          Sara  Laptop       1.0  52000.0
4       105          Amit  Mobile       3.0  20000.0
5       106         Kiran  Tablet       2.0  21000.0
7       107          Neha  Laptop       1.0  48000.0
8       108         Pooja  Mobile       2.0  16000.0
9       109          Ravi  Laptop       1.0  20000.0